cpp/examples/thirdPartyLibraryExamples/gsoapExamples/certificateSigningRequest/PolicyNetCA.CertificateSigningRequest.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xop="http://www.w3.org/2004/08/xop/include"
 xmlns:xmime5="http://www.w3.org/2005/05/xmlmime"
 xmlns:policynet="urn:policynet/0.0.0">
 <SOAP-ENV:Header>
  <policynet:LoginUsername></policynet:LoginUsername>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <policynet:CertificateSigningRequest>
   <policynet:Request>
    <policynet:EndEntity>
     <policynet:Device>
      <policynet:McUID></policynet:McUID>
     </policynet:Device>
    </policynet:EndEntity>
    <policynet:CSR></policynet:CSR>
   </policynet:Request>
  </policynet:CertificateSigningRequest>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
